doc/td/td_classe_complexe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Fraction de nombres complexes</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="td_pointeur_fonction.html">Compilation, pointeur & références </a><a href="td_specificite_c++.html">Spécificités du C++ </a><a href="td_classes.html">Classes en C++ </a><a href="td_classe_complexe.html">Fraction de nombres complexes </a><a href="td_nombre_aleatoire.html">Constructeur & destructeurs </a><a href="td_surcharge_operateur.html">Surcharge d'opérateur </a><a href="td_polymorphisme.html">Polymorphisme & classe abstraite </a><a href="td_blackjack.html">Jeu du blackjack </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Fraction de nombres complexes</h1><hr/>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Classe <code>Complexe</code></h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Écrire une classe <code>Complexe</code>, possédant :
</p>

<ul class="org-ul">
<li>Deux membres de type <code>double</code> :

<ul class="org-ul">
<li>Partie réelle,</li>
<li>Partie imaginaire;</li>
</ul></li>

<li>Un ou plusieurs constructeurs;</li>

<li>Une méthode <code>affiche</code> pour les tests;</li>

<li>Des méthodes d&rsquo;accès : partie réelle, partie imaginaire, module, argument;</li>

<li>Des méthodes de modification : <code>set_real_imag(double, double)</code> et
<code>set_mod_arg(double, double)</code>;</li>

<li>Une méthode retournant le conjugué.</li>
</ul>


<p>
Écrire ensuite les fonctions d&rsquo;addition, soustraction, multiplication, et
division, suivant ce prototype :
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Complexe</span> <span class="org-function-name">operation</span>(<span class="org-keyword">const</span> <span class="org-type">Complexe</span>&amp; <span class="org-variable-name">z1</span>, <span class="org-keyword">const</span> <span class="org-type">Complexe</span>&amp; <span class="org-variable-name">z2</span>);
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Évolution de la classe <code>Complexe</code></h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
Faire évoluer la classe <code>Complexe</code>, <b>sans changer son interface publique</b>, en y
ajoutant deux membres de données :
</p>

<ul class="org-ul">
<li>Module,</li>
<li>Argument.</li>
</ul>

<p>
Ainsi, les méthodes d&rsquo;accès au module et à l&rsquo;argument seront plus rapide,
puisqu&rsquo;il leur suffira de lire la valeur stockée, et non plus de recalculer à
la volée.
</p>

<p>
S&rsquo;assurer que les constructeurs et toutes les méthodes de modification
préservent la synchronisation entre les quatre valeurs stockées.
</p>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Classe <code>Fraction</code></h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
Sur le même modèle, écrire une classe <code>Fraction</code>, possédant :
</p>

<ul class="org-ul">
<li>Deux membres entiers :

<ul class="org-ul">
<li>Numérateur,</li>
<li>Dénominateur;</li>
</ul></li>

<li>Un ou plusieurs constructeurs;</li>

<li>Une méthode <code>affiche</code> pour les tests (qui affiche la fraction sous la forme
Numérateur/Dénominateur <i>e.g.</i> 4/3);</li>

<li>Des méthodes d&rsquo;accès;</li>

<li>Une méthode de modification;</li>

<li>Une méthode retournant la fraction inverse (dénominateur / numérateur);</li>

<li>Une méthode <code>reduire</code> : qui réduit la fraction <i>i.e.</i> 28/6 devient 14/3;</li>

<li><code>approx</code> : qui retourne la valeur approchée de la fraction par un <code>double</code>.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
